app/views/users/index.html.erb

SELECT "users".* FROM "users" ORDER BY "users"."id" ASC
---
        <td><%= link_to "Show", user_path(user) %></td>
        <td>フォロー数：<%= user.following_user.count %></td>