app/views/books/index.html.erb

            <%= link_to book_favorites_path(book, order_sort: 1), method: :delete do %>
             ♥<%= book.favorites.count %>
---
SELECT COUNT(*) FROM "favorites" WHERE "favorites"."book_id" = ?  [["book_id", 2]]

        <% end %>
        <td>コメント数：<%= book.post_comments.count%></td>
---
SELECT COUNT(*) FROM "post_comments" WHERE "post_comments"."book_id" = ?  [["book_id", 2]]