app/views/books/show.html.erb

            <%= link_to book_favorites_path(@book, order_sort: 0), method: :delete do %>
             ♥<%= @book.favorites.count %>
---
SELECT COUNT(*) FROM "favorites" WHERE "favorites"."book_id" = ?  [["book_id", 3]]

            <%= link_to book_favorites_path(@book, order_sort: 0), method: :post do %>
              ♡<%= @book.favorites.count %>
---
SELECT COUNT(*) FROM "favorites" WHERE "favorites"."book_id" = ?  [["book_id", 3]]