app/controllers/post_comments_controller.rb

SELECT  "books".* FROM "books" WHERE "books"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
INSERT INTO "post_comments" ("comment", "user_id", "book_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["comment", "aaaa"], ["user_id", 1], ["book_id", 1], ["created_at", "2021-01-04 08:36:23.236843"], ["updated_at", "2021-01-04 08:36:23.236843"]]
---
  def create
    book = Book.find(params[:book_id])
    comment = current_user.post_comments.new(post_comment_params)
    comment.book_id = book.id
    comment.save

DELETE FROM "post_comments" WHERE "post_comments"."id" = ?  [["id", 2]]
SELECT  "post_comments".* FROM "post_comments" WHERE "post_comments"."id" = ? AND "post_comments"."book_id" = ? LIMIT ?  [["id", 2], ["book_id", 2], ["LIMIT", 1]]
---
  def destroy
    PostComment.find_by(id: params[:id], book_id: params[:book_id]).destroy