app/controllers/users_controller.rb

  def index
    @users = User.all.order(id: "ASC")
    @user = User.find(current_user.id)
---
SELECT "users".* FROM "users" ORDER BY "users"."id" ASC
SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]

  def show
    @user = User.find(params[:id])
    @books = Book.where(user_id: params[:id])
---
SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
SELECT "books".* FROM "books" WHERE "books"."user_id" = ?  [["user_id", 1]]

  def ensure_correct_user
    @user = User.find_by(id:params[:id])
---
SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]